tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "microsoft/git"
brew "bat"
brew "bat-extras"
brew "python3"
brew "pip3"
brew "cmake"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "git-delta"
brew "go"
brew "gopls"
brew "helix"
brew "hyperfine"
brew "jq"
brew "just"
brew "lua"
brew "lua-language-server"
brew "poetry"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "taplo"
brew "tealdeer"
brew "xsv"
cask "font-jetbrains-mono-nerd-font"
cask "keyclu"
cask "powershell"
cask "raycast"
cask "rectangle"
cask "wezterm"
